<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SpecializationsFromFoldersSeeder extends Seeder
{
    public function run(): void
    {
        $specializations = [
            'أحياء',
            'إدارة الأعمال',
            'إدارة الموارد البشرية',
            'الأحياء الدقيقة',
            'الأدب العربي',
            'الأمن السيبراني',
            'الإدارة العامة',
            'الاقتصاد الإسلامي',
            'الاقتصاد الجزئي',
            'الاقتصاد الكلي',
            'البلاغة',
            'التاريخ',
            'التربية الخاصة',
            'التربية العامة',
            'التصميم الجرافيكي',
            'التفسير',
            'الجراحة العامة',
            'الجغرافيا',
            'الحديث',
            'الخدمة الاجتماعية',
            'الذكاء الاصطناعي',
            'الزراعة',
            'السياحة',
            'الطب البشري',
            'الطب الشرعي',
            'العقيدة',
            'الفقه',
            'الفنون التشكيلية',
            'الفنون التطبيقية',
            'الفنون المسرحية',
            'الفيزياء',
            'القانون الإداري',
            'القانون الجنائي',
            'القانون الدستوري',
            'القانون الدولي',
            'القانون العام',
            'القانون المدني',
            'القياس والتقويم',
            'الكيمياء',
            'اللغة العربية',
            'المحاسبة الإدارية',
            'المحاسبة المالية',
            'المراجعة والتدقيق',
            'الموسيقى',
            'النحو والصرف',
            'الهندسة البحرية',
            'الهندسة الكهربائية والإلكترونية',
            'الهندسة الكيميائية',
            'الهندسة المدنية',
            'الهندسة المعمارية',
            'الهندسة الميكانيكية والصناعية',
            'الهندسة النفطية',
            'الهندسة النووية',
            'تربية الطفل',
            'تربية بدنية',
            'تقنية المعلومات',
            'رياضيات',
            'طب الأطفال',
            'طب الطوارئ',
            'طب العيون',
            'طب المجتمع',
            'طب النساء والولادة',
            'علم الاجتماع',
            'علم الحيوان',
            'علم النبات',
            'علوم البيئة',
            'علوم الحاسوب',
            'علوم سياسية',
            'فلسفة',
            'نظم المعلومات',
            'هندسة الاتصالات',
            'هندسة البرمجيات',
            'هندسة التعدين والجيولوجيا',
            'هندسة الحاسوب',
            'هندسة الشبكات',
            'هندسة الطيران',
            'هندسة المواد والمعادن',
        ];

        foreach ($specializations as $name) {
            DB::table('specializations')->updateOrInsert([
                'name' => $name
            ]);
        }
    }
}
